const ruTranslations = {
  header: {
    home: "Главная",
    about: "О нас",
    contact: "Контакты",
    testimonial: "Отзывы",
    frequentlyQA: "Вопросы/Ответы",
    transaction: "Транзакция",
    register: "Регистрация",
  },
  footer: {
    privacyPolicy: "Политика конфиденциальности",
    termsAndConditions: "Условия и требования",
    developedBy: "Разработано",
  },
  home: {
    title: "Возможность покупки и обналичивания криптовалюты",
    description:
      "Безопасные операции с криптовалютой: покупка, продажа и обмен с использованием современных технологий шифрования.",
    getStarted: "Начать сейчас",
  },
  transaction: {
    title: "Возможности Cryptobit",
    exchangeTitle: {
      line1: "Безопасный способ обмена",
      line2: "Выгодный обмен",
    },
    loader: "Загрузка...",
    cryptocurrencies: "Криптовалюты",
    minCount: "Мин",
    senderWalletRequired: "Необходимо указать кошелек отправителя",
    senderWalletMinLength: "Минимальная длина кошелька 26 символов",
    senderWalletPlaceholder: "Кошелек отправителя",
    recipientWalletRequired: "Необходимо указать кошелек получателя",
    recipientWalletPlaceholder: "Кошелек получателя",
    saveWallet: "Сохранить кошелек",
    selectCrypto: "Выберите криптовалюту",
    continue: "Продолжить",
  },
  about: {
    title: "ТРАНЗАКЦИИ",
    aboutTitle: {
      line1: "Безопасный способ обмена",
      line2: "Выгодный обмен",
    },
    description:
      "Быстрое обналичивание и покупка криптовалюты – то, чем гордится наша платформа. Гарантия конфиденциальности, сохранность данных и быстрые транзакции.",
    block1: "Биржевая стоимость",
    block2: "Безопасность пользователей",
    block3: "Панель управления",
    block4: "Реестр активов",
  },
  testimonial: {
    label: "ИСТОРИИ КЛИЕНТОВ",
    title: {
      line1: "Отзывы клиентов ",
      line2: "Cryptobit",
    },
    text: {
      line1: "Все наши клиенты",
      line2: "Довольны сервисом",
    },
  },
  frequentlyQA: {
    subtitle: "Вопросы и Ответы",
    title: "Часто задаваемые вопросы",
    description:
      "Глобальная сеть с передовыми технологиями и эффективным взаимодействием между пользователями",
  },
  contact: {
    subtitle: "Контактная информация",
    title: "Напишите нам",
    getInTouch: "Свяжитесь с нами",
    name: "Ваше имя",
    email: "Введите E-Mail",
    subject: "Тема",
    message: "Сообщение",
    sendMessage: "Отправить сообщение",
  },
  payment: {
    titleError: "Данные об оплате отсутствуют",
    textError: "Пожалуйста, создайте новый запрос на оплату.",
    title: "Оплата по запросу",
    info: "После оплаты заявка отправляется на обработку, которая длится 10-15 минут, после чего средства зачисляются на ваш кошелек.",
    commission: "Комиссия составляет 1$",
    label: "Отдаете",
    receive: "Получаете",
    formTitle: "Выполните оплату на криптокошелек",
    formLabel: "Сеть кошелька",
    formWallet: "Кошелек (хеш)",
    cryptocurrency: "Криптовалюта",
    request: "Номер запроса",
    status: "Статус запроса",
    formDescription: "После оплаты заявки нажмите кнопку 'Оплачено'",
    paymentExpected: "Ожидается оплата",
    closeRequest: "Закрыть запрос",
    paid: "Оплачено",
    processing: "Обработка...",
  },
  paymentSuccess: {
    title: "Оплата успешно выполнена!",
    description: "Ваша транзакция успешно обработана.",
    orderId: "Номер заказа:",
    status:
      "Транзакция обрабатывается. Пожалуйста, подождите 10-15 минут для зачисления средств.",
    returnHome: "Вернуться на главную",
  },
};

export default ruTranslations;
